def area(a):
    '''
    Возвращает площадь квадрата со стороной a возводя a в квадрат

            Параметры:
                    a (float): сторона квадрата
            
            Возвращаемое значение:
                    a * a (float): площадь квадрата

            Пример вызова:
                    area(4.0) -> 16.0
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a

            Параметры:
                    a (float): сторона квадрата
            
            Возвращаемое значение:
                    4 * a (float): периметр квадратa

            Пример вызова:
                    area(4.0) -> 16.0
    '''
    return 4 * a
